const f = require('../if-09.js');

QUnit.test("ЗАДАЧА 09. S(x1,y1,x2,y2,x3,y3)", 
  function(assert){
	assert.deepEqual(f(-1,-1,0,2,1,-1), -1, "Не выполнено f(-1,-1,0,2,1,-1) === -1");
	assert.deepEqual(f(2,3,6,7,-7,2), 10.88147994770095, "Не выполнено f(2,3,6,7,-7,2) === 10.88147994770095");
	assert.deepEqual(f(2,7,-1,4,1,2), -1, "Не выполнено f(2,7,-1,4,1,2) === -1");
	assert.deepEqual(f(0,0,0,0,0,0), -1, "Не выполнено f(0,0,0,0,0,0) === -1");
	assert.deepEqual(f(2,3,-3,1,-4,-2), 4.178986028702892, "Не выполнено f(2,3,-3,1,-4,-2) === 4.178986028702892");
  }
);
